In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
prenoms = ['etienne','olivier','jean','mike']

In [6]:
age = pd.Series([13,24,52,20], index=prenoms)
taille = pd.Series([160,175,200,190], index=prenoms)
sexe = pd.Series(list('fhfh'), index=prenoms)

In [7]:
df = pd.DataFrame({'age':age, 'taille':taille , 'sexe':sexe})

In [8]:
df

         age  taille sexe
etienne   13     160    f
olivier   24     175    h
jean      52     200    f
mike      20     190    h

In [9]:
df.index

Index(['etienne', 'olivier', 'jean', 'mike'], dtype='object')

In [10]:
df.columns

Index(['age', 'taille', 'sexe'], dtype='object')

In [11]:
df.values

array([[13, 160, 'f'],
       [24, 175, 'h'],
       [52, 200, 'f'],
       [20, 190, 'h']], dtype=object)

In [42]:
df.describe()

              x    y    z
count  3.000000  2.0  2.0
mean   1.333333  1.0  1.0
std    0.577350  0.0  0.0
min    1.000000  1.0  1.0
25%    1.000000  1.0  1.0
50%    1.000000  1.0  1.0
75%    1.500000  1.0  1.0
max    2.000000  1.0  1.0

In [13]:
df.describe()

             age  taille
count   4.000000    4.00
mean   27.250000  181.25
std    17.114808   17.50
min    13.000000  160.00
25%    18.250000  171.25
50%    22.000000  182.50
75%    31.000000  192.50
max    52.000000  200.00

In [15]:
df.loc['etienne','age']

13

In [16]:
df.loc[:, 'taille']

etienne    160
olivier    175
jean       200
mike       190
Name: taille, dtype: int64

In [17]:
df.loc[:, 'age']<20

etienne     True
olivier    False
jean       False
mike       False
Name: age, dtype: bool

In [19]:
df.loc[df.loc[:, 'taille'] > 180]

      age  taille sexe
jean   52     200    f
mike   20     190    h

In [20]:
df = df.reset_index()

In [21]:
df

     index  age  taille sexe
0  etienne   13     160    f
1  olivier   24     175    h
2     jean   52     200    f
3     mike   20     190    h

In [22]:
df = df.rename(columns={'index':'prenom'})

In [23]:
df

    prenom  age  taille sexe
0  etienne   13     160    f
1  olivier   24     175    h
2     jean   52     200    f
3     mike   20     190    h

In [24]:
df = pd.DataFrame({'age':age, 'taille':taille , 'sexe':sexe})

In [25]:
df

         age  taille sexe
etienne   13     160    f
olivier   24     175    h
jean      52     200    f
mike      20     190    h

In [27]:
df = (df.reset_index()
     .rename(columns={'index':'nom'})
     .set_index('age'))

In [28]:
df

     level_0      nom  taille sexe
age
13         0  etienne     160    f
24         1  olivier     175    h
52         2     jean     200    f
20         3     mike     190    h

In [29]:
df = (df.reset_index()
     .rename(columns={'level_0':'id'}) )

In [30]:
df

   age  id      nom  taille sexe
0   13   0  etienne     160    f
1   24   1  olivier     175    h
2   52   2     jean     200    f
3   20   3     mike     190    h

In [31]:
df1 = pd.DataFrame(np.ones((2,2)),
                  index=list('ab'),
                  columns=list('xy'))

In [32]:
df1

     x    y
a  1.0  1.0
b  1.0  1.0

In [33]:
df

   age  id      nom  taille sexe
0   13   0  etienne     160    f
1   24   1  olivier     175    h
2   52   2     jean     200    f
3   20   3     mike     190    h

In [34]:
df2 = pd.DataFrame(np.ones((2,2)),
                  index=list('ac'),
                  columns=list('xz'))

In [35]:
df2

     x    z
a  1.0  1.0
c  1.0  1.0

In [36]:
df1+df2

     x   y   z
a  2.0 NaN NaN
b  NaN NaN NaN
c  NaN NaN NaN

In [38]:
df = df1.add(df2, fill_value=0)

In [39]:
df.fillna(-1)

     x    y    z
a  2.0  1.0  1.0
b  1.0  1.0 -1.0
c  1.0 -1.0  1.0

In [40]:
df.dropna()

     x    y    z
a  2.0  1.0  1.0

In [ ]:
import math

xn = 1.1
xk = 2.2
h = 0.1
n = int((xk - xn) / h + 1)

for m in range(1, n + 1):
    s1 = 0
    for i in range(1, 3):
        p = 1
        for j in range(i, 4):
            s3 = 0
            eps = 1e-5
            k = 0
            y = 1
            while abs(y) >= eps:
                if (i + k) % 2 != 0:
                    y = (0.1 + xn**(i + k)) / math.factorial(k + 3)
                else:
                    y = xn**(i + j + k) / math.factorial(k)
                    k += 1
                    s3 += y
            p *= s3
        s1 += math.pi + p
    print("x={:5.3f} f(x)={:5.3f}".format(xn, math.log(s1)))
    xn += h